
 //Math.random()
    // Math.random връща число от интервала от 0 до 1
    // обект Math се изписва с главна буква, такива имат за цел да покажат, че са по-особени
    // Math съдържа в себе си функции, които могат да извършват мат. операции
    // Math.floor(закръгля надолу) и Math.ceil(закръгля нагоре) - закръглят стойности
    

/**  - това е докблок (DocBlock?) - коментар на функцията ползват се в случайте когато искаме да подскажем за нещо, което не се разбира от самата програма
 * правило е, че функциите трябва да бъдат самодокументиращи се и да имат правилно име, добре дефинирани аргументи и тяло
 * - дава допълнителна информация докато пишем функцията, полза се главно от хората, които пишат библиотеки от код
 * Правила:
 * - името на функцията трябва да съдържа действие
 * - понякога е ОК да имаме и концепция (напр. оperationIdentify)
 * - спазва се camelCase конвенция
 * всеки един от елементите на тялото на функцията трябва да бъде разписан по същите правила
 * This function is responsible for generating fixed random number
 * @param {*} from - min number lower bound
 * @param {*} to - max number upper bound
 */
 function getRandomNumber(from, to){

    let upperBound = (to - from);
    return Math.ceil((Math.random() * upperBound) + from);

    // алтернативни варианти - 
    // - let result = Math.ceil((Math.random() * upperBound) + from);
    //return result;
}