   
   const fs = require('fs');
   
// - модул за работа с файлова система; fs е обект - съдържа всички функции за работа с файлове
// oбект - набор от променливи + функции


// 1. Влизаме в папка scenario-1
// стъпка 1 и 2 са близки по аналогия от гл.точка на автоматизираното тестване, понеже четем съдържанието на папката
// 2. Откриваме всички файлове поместени в нея
// __dirname дава ми пътя до текущия файл, но само файла, който изпълнявам в момента
// -- за да не се специфицират директно пътища

//const scenario1FileList = fs.readdirSync();
console.log(`${__dirname}\\scenario-1`);
//магическа променлива на NodeJS





// 3. Верифицираме наличието им и техните имена
